Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname WDSJ2K
WDSJ2K(config)#interface giga
WDSJ2K(config)#interface gigabitEthernet 0/0
WDSJ2K(config-if)#ip address 10.10.10.1 255.255.255.0
WDSJ2K(config-if)#duplex uto
                         ^
% Invalid input detected at '^' marker.
	
WDSJ2K(config-if)#duplex auto
WDSJ2K(config-if)#speed auto
WDSJ2K(config-if)#no shutdown
WDSJ2K(config-if)#end


WDSJ2K#copy running-config startup-config
Destination filename [startup-config]? 
Building configuration...
[OK]


WDSJ2K#show running-config
Building configuration...

Current configuration : 703 bytes
!
version 15.1
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname WDSJ2K
!
interface GigabitEthernet0/0
 ip address 10.10.10.1 255.255.255.0
 duplex auto
 speed auto


